#妹子约会终极版"
print("请问你是妹子还是汉子")
sex = int(input("妹子请按1,汉子请按0: "))
if sex == 1:
    print("妹子请走左边...")
    happy=int(input("妹子很无聊么？约么？（约会请按1,不约请0）: "))
    if happy == 1:
        print("小伙子有前途，妹子同意你的约会，下面开始你表演")
        print("@#**/*&*&*@^&^@%@%^#&@")
        print("...............................")
        print("经过一顿猛如虎的操作，妹子同意去宾馆了，嘿嘿！！！")
        card = int(input("带身份证了么？（带了请按1,没带请按0）: "))
        money = int(input("带够钱了？妹子要去五星级酒店（有钱请按1,没钱请按0 ：）"))
     
        if card == 1 and money == 1:
            print("土豪，求包养！~~~~")
            pay = int(input("付费方式：（现金请按1,刷卡请按2,微信请按3,支付宝请按4）"))
            if pay == 1:
                print("您现金支付999元，祝您今晚愉快")
            elif pay == 2:
                print("您刷卡支付999元，祝您今晚愉快")
            elif pay == 3:
                print("您微信支付999元，祝您今晚愉快")
            else:
                print("您支付宝支付999元，祝您今晚愉快")
        else:
            print("草，今天不宜约会")
            boring = int(input("不能约会怎么办，看会片吧（看片请按1,不看请按0）: "))
            if boring == 1:
                print("打开**视频网站")
                print("$~%$%^$GDD&^%**%&^$%%&*/*^%&%&")
                print("字幕军已吐血.....这个电影 嘿嘿 很具有观赏性")
            else:
                print("今天不想看片，没意思，玩会游戏吧，来吃鸡走起~~~~")
    elif happy == 0:
        print("人长的太丑，妹子不同意，去韩国整容吧")
elif sex == 0:
    print("汉子请走右边")
    find = int(input("想约会么？（想请按1，不想请按0）"))
    if find == 1:
        print("对妹子还是很有兴趣的****")
        print("撩妹秘籍，详情下次告知")
    else:
        print("cao 对女孩不感兴趣")
        print("建议多看点教育片...")
else:
    print("人妖请走专属通道")
